[
  {
    "id": 1,
    "name": "Xynexa – Team Collaboration",
    "image": "https://i.ibb.co.com/0yn8SC0q/xynexa-vercel-app.png",
    "technologies": ["Next.js", "Tailwind CSS", "Clerk Auth", "Node.js", "Express.js", "Mongoose", "WebSockets"],
    "description": "A real-time team collaboration platform with task management, chat, and video conferencing features.",
    "liveLink": "https://xynexa.vercel.app",
    "githubLink": {
      "client": "https://github.com/mdabdulkyum1/xynexa",
      "server": "https://github.com/mdabdulkyum1/xynexa-server"
    },
    "challenges": "Integrating real-time communication with WebSockets and ensuring smooth video conferencing similar to Google Meet.",
    "improvements": "Plan to add AI-based meeting summaries and task automation features for team efficiency.",
    "details": "Xynexa enables seamless collaboration through a unified dashboard for project and task management. The platform includes built-in chat and video conferencing powered by WebSockets for real-time updates. Security and scalability were key focuses, with Clerk authentication and efficient MongoDB query design ensuring a secure and responsive experience."
  },
  {
    "id": 2,
    "name": "Parcel Transportation System",
    "image": "https://i.ibb.co.com/GQPJfQY2/parcel-transpotation-web-app-1.png",
    "technologies": ["React", "Node.js", "Express.js", "MongoDB", "Stripe", "JWT", "Tailwind CSS"],
    "description": "A logistics management platform that connects users, delivery personnel, and admins for efficient parcel handling.",
    "liveLink": "https://parcel-transpotation.web.app",
    "githubLink": {
      "client": "https://github.com/ashrafulhossain1/parcel-transport-client",
      "server": "https://github.com/ashrafulhossain1/parcel-transport-server"
    },
    "challenges": "Implementing secure role-based authentication with JWT and managing real-time delivery status updates.",
    "improvements": "Planning to integrate map tracking and AI-based delivery route optimization.",
    "details": "This platform streamlines parcel booking, assignment, and delivery tracking with role-based dashboards for users, delivery staff, and admins. Secure payments are handled through Stripe subscriptions, and authentication is managed via JWT tokens. Future improvements aim to enhance user convenience through real-time map tracking and smart delivery routing."
  },
  {
    "id": 3,
    "name": "E-Language Learning",
    "image": "https://i.ibb.co.com/sjg1SYJ/language.png",
    "technologies": ["React", "Node.js", "MongoDB", "Stripe", "Tailwind CSS"],
    "description": "A scalable e-commerce platform with user authentication, payment integration, and a responsive UI.",
    "liveLink": "https://language--exchange-a-11.web.app",
     "githubLink": {
      "client": "https://github.com/ashrafulhossain1/language-exchange",
      "server": "https://github.com/ashrafulhossain1/language-exchange-server"
    },
    "challenges": "Implementing secure payment integration with Stripe and optimizing database queries for large product datasets.",
    "improvements": "Planning to enhance the admin panel with more analytics features and implement AI-based product recommendations.",
    "details": "This e-commerce platform was designed to handle a large number of users and products while ensuring a smooth user experience. One of the main challenges was creating a secure payment system using Stripe, ensuring that user data was protected during transactions. Additionally, optimizing MongoDB queries for faster data retrieval was a key focus. Future improvements include adding more comprehensive analytics for admins and incorporating AI to suggest products to users based on their browsing and purchasing history."
  }
]
